package basicOfSoftwareCodeDevelopment;

// Вывести на экран соответствий  между символами и их численными обозначениями в памяти компьютера.

public class Cycles_6 {

    public static void main(String[] args) {
        for (int i = 1; i <= 126; i++) {
            System.out.println(i + " " + (char) i);
        }

    }

}
